Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementMeshAttributes.MeshReinforcementVisibilityLongitudinal Property
 Defines which longitudinal wires in the mesh appear in drawings.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementBase.ReinforcementVisibilityTypes MeshReinforcementVisibilityLongitudinal { get; set; }
Public Property MeshReinforcementVisibilityLongitudinal As ReinforcementBase.ReinforcementVisibilityTypes
	Get
	Set
Property Value
Type: ReinforcementBase.ReinforcementVisibilityTypes
See Also
Reference
ReinforcementBase.ReinforcementMeshAttributes Class
Tekla.Structures.Drawing Namespace